import glob
import os
import xml.etree.ElementTree as ET
import cv2
import shutil
import pandas as pd
from tqdm import tqdm


# VOC -> YOLO format
def xml_to_yolo_bbox(bbox, w, h):
    # xmin, ymin, xmax, ymax
    x_center = ((bbox[2] + bbox[0]) / 2) / w
    y_center = ((bbox[3] + bbox[1]) / 2) / h
    width = (bbox[2] - bbox[0]) / w
    height = (bbox[3] - bbox[1]) / h
    return [x_center, y_center, width, height]


def xml_to_yolo():
    # label dict
    label_df = pd.read_csv('.\\labelcsv.csv', encoding='utf-8')
    label_df.columns = ['code', 'name']
    code, name = label_df['code'], label_df['name']
    label_dict = {}
    for code, name in zip(code, name):
        name = name.replace(u'\xa0', u'')
        label_dict[name] = code
    # print(label_dict)

    # xml, jpg path
    xml_path = glob.glob(os.path.join('D:\\dataset01', '*', 'labels', '*', '*_meta.xml'))

    errors = []

    for path in tqdm(xml_path):
        tr_vl = path.split('\\')[-4]

        w = 2988
        h = 2988
        tree = ET.parse(path)
        root = tree.getroot()

        element = root.find('annotation')
        file_name = element.find('filename').text
        file_name = file_name.replace('.jpg', '.txt')
        for member in element.findall('object'):
            try:
                label = member.find('name').text
                label = label_dict[label]
            except:
                # print(member.find('name').text)
                if member.find('name').text not in errors:
                    errors.append(member.find('name').text)
                    print(member.find('name').text)
                continue
            xmin = int(member.find('bndbox').find('xmin').text)
            xmax = int(member.find('bndbox').find('xmax').text)
            ymin = int(member.find('bndbox').find('ymin').text)
            ymax = int(member.find('bndbox').find('ymax').text)
            bbox = [xmin, ymin, xmax, ymax]
            bbox = xml_to_yolo_bbox(bbox, w, h)
            yolo_x = str(round(bbox[0], 3))
            yolo_y = str(round(bbox[1], 3))
            yolo_w = str(round(bbox[2], 3))
            yolo_h = str(round(bbox[3], 3))

            os.makedirs(f'D:\\temp\\{tr_vl}', exist_ok=True)
            os.makedirs(f'D:\\temp\\{tr_vl}\\labels', exist_ok=True)

            with open(f'D:\\temp\\{tr_vl}\\labels\\{file_name}', 'a') as f:
                f.write(f'{label} {yolo_x} {yolo_y} {yolo_w} {yolo_h} \n')
        if os.path.exists(f'D:\\temp\\{tr_vl}\\labels\\{file_name}') == False:
            with open(f'D:\\temp\\{tr_vl}\\labels\\{file_name}', 'w') as f:
                f.write('')

    print(errors)


if __name__ == '__main__':
    # xml_to_yolo()
    a = ['해태후레쉬포도50_1.5L', '유동순살왕꼬막_골뱅이280G', 'Dole후룻볼복숭아4입100_주스', '토핑오트_애플시나몬', '아넬라사과디저트_2입', '동서식품_맥심원두분쇄시그니처블렌드_200G', '남양_루카스나인바닐라라떼_10T169G',
         '서울우유저지방나100_', '매일상하목장유기농우유저지방2_', '동원쎈쿡100_통곡물밥3개입585G', '담터울금500100ML_2입200ML', '트릿지후무스앤토마토100G_2EA200G', '한일식품혼면혼밥본고장바지락칼국수_밥276.5G',
         '한일식품혼면혼밥본고장김치칼국수_밥274.5G', '이마트피코크유기농군밤100G_2봉', '이마트피코크유기농현미제주녹차1.5G_100개입',
         '이마트피코크유기농현미하동녹차1.5G_50개입', '이마트피코크유기농시원한찬물제주녹차1.2G_50개입', '이마트피코크유기농현미제주녹차1.5G_50개입',
         '씨제이제일제당다시다요리의신얼큰국물10G_5개입50G', '롯데2_복숭아350ML', '롯데2_부족할때복숭아1.5L', '서울강릉커피블랙2_1',
         '이디야_비니스트아메리카노오리지널_30T30G', '동서식품_맥심아라비카100아메리카노_20T18G', '네슬레_네스카페수프리모디카페인_150G', '매일썬업100_파인애플750ML',
         '매일유업요미요미오가닉퍼프단호박_고구마42G', '광동제약광동홍삼쌍화진100ML_10', '광동제약광동생강쌍화진100ML_10', '동원모이스트루어덜트참치_닭고기80G',
         '미소캣퓨어네츄럴파우치건강한연어_고등어80G', '동원청미채옐로우200ML_3', '안동소주일품안동소주21_350ML', '한국마즈위스카스고등어85G_6개입',
         '한국마즈위스카스구운고등어85G_6개입', '한국마즈위스카스참치85G_6개입', '롯데델몬트포도100_400ML', '따뜻한허니레몬_배280ML', '델몬트콜드포도과즙100_1.89L',
         '파워루트_알리카페카푸치노_10T200G', '남양유업_루카스나인그린티라떼10T_189G', '파스퇴르_오직요구르트100_400G', '브레드가든)머랭쿠키믹스밀크맛_산딸기맛150G', '동원F_B)양반수라차돌삼합죽420G', '동원F_B)소고기장조림270G', '동원F_B)야채죽287.5G', '디아지오코리아)조니워커_레드레이블_200ML', '남양유업)든든한끼바나나_곤약150G', '동원F_B덴마크요거밀단호박150G', '동원F_B덴마크요거샐러드옐로우150G', '동원F_B)덴맠요거밀자색고구마150G', '남양유업)불가리스100_무첨가프리미엄플레인435G', '동원F_B)리챔오리지널900G', '동원F_B)리챔오리지널300G', '동원F_B)돌트로피칼후르츠칵테일836G', '롯데미림알콜14_', '청정원)닭볶음탕양념480G_2(번들)', '롯데)델몬트콜드복숭아과즙100_', '청정원)유기농100_국내산우리아이보리차', '청정원)청정원유기농100_국내산현미보리차', '남포물산)국물이더진한미역귀_참미역', '씨제이)스팸핫_스파이시', '씨제이)스팸25_라이트', '금강B_F)칸타타아메리카노', '오리온)오_그래놀라과일', '엠에스씨)처음먹는유기농과일과_채주스', '드림펫푸드)이코노미런치플러스캔참치_게살스틱', '동원F_B)뉴트리플랜스페셜데이편안한저녁김치와닭고기', '동원F_B)뉴트리플랜건강프로젝트장_유리너리', '동원F_B)뉴트리플랜흰살참치와멸치', '팜팩토리)아넬라사과_바나나디저트', '팜팩토리)아넬라사과_자두디저트', '팜팩토리)아넬라배_사과디저트', '머거본)넛츠_스낵', '안동소주일품)안동소주일품17_', '롯데)2_부족할때아쿠아500ML', '롯데)데일리C레몬1000C_파우치230ml', '델몬트팜_홈청포도1.2L', '델몬트팜_홈오렌지1.2', '서울에프엔비쥬시쿨금귤_감귤에이드', '남양_루카스나인라떼_10T149G', '동서식품_제티초콕쿠키앤초코맛_20T72G', '동원F_B)양반진국소고기무국460G', '동원F_B)덴마크구워먹는치즈오리지널125G', '남양)퍼먹는불가리스든든한끼호두_아몬드150G', '매일유업)매일썬업오렌지100_200ML', '동원F_B)달달하고부드러운흑당크림라떼300ML', '동원F_B)콩카페코코넛라떼250ML', '대상)100_자연숙성발효초사용석류250ML', '에스앤피)오가닉카모마일_스피어민트', '자임)100_NFC착즙주스사과_비트_당근', '자임)물한방울넣지않은배_도라지', '자임)NFC착즙주스100_석류', '한국쥬맥스)해피데이아로니아_체리', '금강B_F)청춘전투자몽에꿀한스푼', '금강B_F)청춘전투진저에레몬한방울', '금강B_F)청춘전투세상에없는캐모마일', '유한회사)에버그로펫밀크피부_모발', '신성티엔에프)아이밀홈쿡순수요리육수(한우_표고버섯과채소)', '코스맥스)뱃심아이스푸로_푸리바이오틱스', '머거본)머거본5봉기획팩(커피땅콩3봉_꿀땅콩2봉)', '롯데네슬레코리아)팬시피스트메들리파테플로렌틴치킨_치즈', '드림펫푸드)이코노미런치플러스캔참치_치어', '아이배냇)쌩마멧유기농사과_배', '아이배냇)쌩마멧유기농사과_바나나', '팜팩토리)하넬라사과_망고디저트', '웰팜)100_유기농딸기그레이프', '미소)캣퓨어파우치참치_도미', '오션)마시꾸냥(참치_닭가슴살)', '오션)마시꾸냥(참치_헤어볼)', '오션)마시꾸냥(참치_타우린)', '동원)뉴트리플랜건강프로젝트체중조절_관절', '드림펫푸드)이코노미런치플러스캔참치_고등어', '드림펫푸드)이코노미런치플러스캔참치_치킨', 'nutrlon_taste수박소다350ML', '카스레드6.9_(캔)', '세븐브로이맥주)맥아_더', '서울_짜요짜요요구르트포도_240G', '서울_짜요짜요요구르트복숭아_240G', '동서식품_맥심카페카라멜향마키아또_10T130G', '동서식품_제티초콕초코렛맛_10T36G', '이디야_커피랩페르소나블렌드_200G', '매일바이오화이버_칼슘', '남양우유GT찐_하고달달한딸기', '매일소화가잘되는우유저지방2_락토프리', '남양우유GT찐_하고달달한초코', '알프레도파스타_소스', '에스앤비골든카레중간매운맛(카레분말8.6_함유)', '롯데칠성음료과실주용담금소주25_',
         '롯데칠성음료과실주용담금소주30_', '서울장수월매쌀막걸리6캔350ML_6', '롯데네슬레코리아)팬시피스트화이트라벨치킨_튜나플레이크85G_3개입', '롯데네슬레코리아)팬시피스트인스퍼레이션치킨_파스타_시금치', '코카)미닛메이드식이섬유사과_크랜베리1.2L', '코카콜라)미닛메이드벚꽃_사과1.2L', '헛개숙취세트3G_100ML', 'Dole후룻볼트로피칼4입100_주스', '오프룻딸기_알로에', '심플러스오리지날감자칩샤워크림_어니언향', '맥널티_자메이카블루마운틴블렌드분쇄_226G', '매일_상하목장마이리틀유기농짜먹는요거트사과바나나_85G', '서울_짜요짜요요구르트딸기_240G', '동서식품_제티초콕쿠키앤쵸코_36G', '마켓오오_그래놀라바검은콩', '꽃샘식품립톤아이스티레몬_라임300G', '남양든든한끼밤_곤약', '매일썬업100_사과', '네슬레블루레모네이드C_40T', '코코넛밀크(AROY-D_캔)', '몬람부탄_파인애플', '대상청정원카레여왕구운마늘_깊고풍부한맛', '씨제이제일제당밥이랑야채_해물혼합팩', '마켓오오_그래놀라바무화과베리4개', '씨제이제일제당스팸핫_스파이시', '에버그로펫밀크눈_관절',
         '매크로통상본마망초코_카라멜타르트9개입', 'CJ더건강한페퍼_갈릭블랙페퍼가햄속으로', '두보식품)기장차조수수율무가30_들어있는맛있는9곡', '화요)화요미니어처3종세트1호(50ML_3)', '롯데칙촉티라미수12_4봉더드림', '풍림푸드복숭아젤리4개입90G_4', '풍림푸드망고젤리4개입90G_4', '오뚜기스위트앤젤복숭아3개입90G_3', '오뚜기스위트앤젤밀감3개입90G_4', '풍림푸드포도젤리4개입90G_4', '매일데르뜨백도3개입130G_3', '델몬트오렌지드링크4개입190ML_4', '델몬트파인애플드링크4개입190ML_4'
, '매일데르뜨감귤3개입90G_3', '매일데르뜨복숭아3개입90G_3', '매일데르뜨자몽3개입130G_3', '사조손이안전한안심따개고추참치3캔100G_3', '사조손이안전한바베큐맛참치3캔100G_3', '사조손이안전한찌개전용참치3캔100G_3', '동원맛있게발라먹는스낵참치상큼마요3캔100G_3', '동원맛있게발라먹는스낵참치고소마요3캔100G_3', '동원맛있게발라먹는스낵참치매콤마요3캔100G_3', '동원부드럽게비벼먹는뽀로로참치키즈3캔100G_3', '동원참치쿡김치찌개용3캔100G_3', '동원참치쿡볶음밥용3캔100G_3', '국순당막걸리쌀6캔350ML_6', '함소아제약함소아삐뽀삐뽀매실담은유자2개입100ML_2', '함소아제약함소아삐뽀삐뽀딸기담은바나나2개입100ML_2', '해우촌돌김자반1_150G_2', '농업회사법인금산인삼주)금산인삼주43_(병)', '씨제이제일제당스팸25_라이트'
, '이마트)갈릭_어니언페퍼솔트그라인더', '블랭크코퍼레이션)소소칩닭가슴살오리지날_치즈30G', '다노)단백질공화국닭가슴살칩_매운카레25G', '다노)단백질공화국닭가슴살칩_오리지날25G', '씨제이올리브영)프레즐앤팝콘카라멜_체다치즈65G', '씨제이올리브영)프레즐앤팝콘초콜릿_솔트65G', '신영에프에스)파슬리100_(독일산)40G', '동원F_B)뉴트리플랜펫밀크반려묘전용우유', '동원F_B)뉴트리플랜모이스트루참치와닭고기', '롯데네슬레코리아)팬시피스트인스퍼레이션참치_호박_통곡물', '롯데네슬레코리아)팬시피스트인스퍼레이션비프_호박_토마토', '채널펫)비타크래프트트리글스(코어피쉬)대구60_이상함유슈가프리', '롯데네슬레코리아)프리스키파티믹스비치사이드새우_게살과참치맛', '에이플러스)초이스엘CHOICEL바삭바삭한스낵참치_치즈', '에이플러스)초이스엘CHOICEL바삭바삭한스낵연어_치킨', '롯데네슬레코리아)팬시피스트화이트라벨연어85G_3개입', '에이플러스)초이스엘CHOICEL바삭바삭한스낵참치_타우린', '인터펫코리아)카카참치_새우(어덜트캣)', '미소)초이스엘참치_게맛살5개입'
, '미소)초이스엘참치_닭가슴살5개입', '미소)초이스엘참치_연어5개입', '롯데네슬레코리아)팬시피스트흰생선_참치85G', '롯데네슬레코리아)팬시피스트흰생선_참치사우티드시푸드85G', '롯데네슬레코리아)팬시피스트치킨_참치85G', '초이스엘참치_닭가슴살80G', '초이스엘참치_연어80G', '롯데델몬트콜드포도과즙100_1L', '푸드웰레몬비타1000_150ML', '매일)페레로로쉐T5_63G', 'Dole후룻볼파인애플4입100_주스', '제주샘술)고소리술29_', '롯데트로피카나퓨어주스오렌지100_190ML', '롯데푸드)오가닉유기농레드비트_배_토마토125ML', '파스퇴르오가닉유기농사과_당근125ML', '코카콜라)미닛메이드벚꽃_사과175ML', '롯데델몬트오렌지100_400ML', '롯데델몬트포도100_1.5L', '경남제약레모나2G_10포', '빙그레토핑프레첼_초코청크', '천하코퍼레이션화이트초코_크랜베리쿠키', '와인나라양평점바바리아0.0_', '뮤어스TEL오리지널롱드링크진_그레이프프루트', '롯데)2_아쿠아수분_미네랄240ML', '롯데)데일리C레몬1000C_(병)140ML', '웰치사과주스100_1L', '롯데곤약젤리망고비타400D_', '롯데)곤약애빠지다자몽_히비스커스130G', '롯데칠성비넛노니주스100_960ML', '롯데)2_부족할때아쿠아PET1.5L', '롯데델몬트콜드오렌지과즙100_', '린트엑설런스다크70_100G', '(주)이마트24민생감자칩사워크림_어니언', '(주)두리두리퀘이커마시는오트밀오트_그린티하동녹차', '(주)두리두리퀘이커마시는오트밀오트_그레인']
    기동 = []
    윤혁 = []
    호정 = []
    영재 = []
    영관 = []
    for i, name in enumerate(a):
        if i<50:
            기동.append(name)
        elif i<100:
            윤혁.append(name)
        elif i<150:
            호정.append(name)
        elif i<200:
            영재.append(name)
        else:
            영관.append(name)

    print(영관)
